{
  "popover": {
    "mapping": {
      "min-width": {
        "value": "50px",
        "type": "space",
        "attributes": {
          "subtype": "space",
          "description": "Controls the minimum width of popover components (small overlay windows that appear when users hover or click on elements). This ensures the popover is always wide enough to be visible and properly displayed.<br>CSS variable: --wm-popover-min-width"
        }
      },
      "min-height": {
        "value": "50px",
        "type": "space",
        "attributes": {
          "subtype": "space",
          "description": "Controls the minimum height of popover components (small overlay windows that appear when users hover or click on elements). This ensures the popover is always tall enough to be visible and properly displayed.<br>CSS variable: --wm-popover-min-height"
        }
      },
      "z-index": {
        "value": "1060",
        "type": "radius",
        "attributes": {
          "subtype": "radius",
          "description": "Controls the stacking order of popover components (small overlay windows that appear when users hover or click on elements). Higher values make the popover appear above other elements, ensuring it's visible on top of all other content.<br>CSS variable: --wm-popover-z-index"
        }
      },
      "gap": {
        "value": "~\"calc({space.1.value} * 2.5)\"",
        "type": "space",
        "attributes": {
          "subtype": "space",
          "description": "Controls the spacing between popover components and their trigger elements (the elements that cause the popover to appear). This creates visual separation between the popover and the element that triggered it.<br>CSS variable: --wm-popover-gap"
        }
      },
      "margin": {
        "value": "{space.1.value}",
        "type": "space",
        "attributes": {
          "subtype": "space",
          "description": "Controls the margin around popover components (small overlay windows that appear when users hover or click on elements). This creates space between the popover and the edges of the screen or other elements.<br>CSS variable: --wm-popover-margin"
        }
      },
      "padding": {
        "value": "{space.0.value}",
        "type": "space",
        "attributes": {
          "subtype": "space",
          "description": "Controls the internal spacing inside popover components (small overlay windows that appear when users hover or click on elements). This creates breathing room around the popover content.<br>CSS variable: --wm-popover-padding"
        }
      },
      "background": {
        "value": "{color.surface.container.@.value}",
        "type": "color",
        "attributes": {
          "subtype": "color",
          "description": "Sets the background color of popover components (small overlay windows that appear when users hover or click on elements). This is the main background color that appears behind the popover content.<br>CSS variable: --wm-popover-background"
        }
      },
      "color": {
        "value": "{color.on-surface.@.value}",
        "type": "color",
        "attributes": {
          "subtype": "color",
          "description": "Sets the text color of popover components (small overlay windows that appear when users hover or click on elements). This determines what color the popover text appears in, which should contrast well with the background for readability.<br>CSS variable: --wm-popover-color"
        }
      },
      "shadow": {
        "value": "{elevation.shadow.1.value}",
        "type": "radius",
        "attributes": {
          "subtype": "elevation",
          "description": "Controls the drop shadow effect around popover components (small overlay windows that appear when users hover or click on elements). This creates a subtle shadow that makes the popover appear to float above the background, giving it depth and elevation.<br>CSS variable: --wm-popover-shadow"
        }
      },
      "radius": {
        "value": "{radius.sm.value}",
        "type": "radius",
        "attributes": {
          "subtype": "radius",
          "description": "Controls the corner rounding of popover components (small overlay windows that appear when users hover or click on elements). This makes the popover appear with rounded corners for a softer appearance.<br>CSS variable: --wm-popover-radius"
        }
      },
      "header": {
        "padding": {
          "value": "{space.4.value}",
          "type": "space",
          "attributes": {
            "subtype": "space",
            "description": "Controls the internal spacing inside popover headers (the top section of popover windows that contains the title). This creates breathing room around the popover header content.<br>CSS variable: --wm-popover-header-padding"
          }
        },
        "color": {
          "value": "{color.on-surface.@.value}",
          "type": "color",
          "attributes": {
            "subtype": "color",
            "description": "Sets the text color of popover headers (the top section of popover windows that contains the title). This determines what color the header text appears in, which should contrast well with the background for readability.<br>CSS variable: --wm-popover-header-color"
          }
        },
        "font-family": {
          "value": "{h4.font-family.value}",
          "type": "font",
          "attributes": {
            "subtype": "font-family",
            "description": "Sets the typeface (font style) for popover headers (the top section of popover windows that contains the title). This determines whether the header text appears in Arial, Times New Roman, or other font styles.<br>CSS variable: --wm-popover-header-font-family"
          }
        },
        "font-weight": {
          "value": "{h4.font-weight.value}",
          "type": "font",
          "attributes": {
            "subtype": "font-weight",
            "description": "Controls how thick or bold the popover headers appear (the top section of popover windows that contains the title). 'normal' makes it regular weight, 'bold' makes it thicker, and numbers (100-900) provide fine control over thickness.<br>CSS variable: --wm-popover-header-font-weight"
          }
        },
        "font-size": {
          "value": "{h4.font-size.value}",
          "type": "font",
          "attributes": {
            "subtype": "font-size",
            "description": "Controls how large the popover headers appear (the top section of popover windows that contains the title). This affects the size of the header text that users see in the popover.<br>CSS variable: --wm-popover-header-font-size"
          }
        },
        "line-height": {
          "value": "{h4.line-height.value}",
          "type": "font",
          "attributes": {
            "subtype": "line-height",
            "description": "Controls the vertical spacing between lines when popover headers wrap to multiple lines. This ensures proper spacing for the header text displayed in the popover.<br>CSS variable: --wm-popover-header-line-height"
          }
        },
        "letter-spacing": {
          "value": "{h4.letter-spacing.value}",
          "type": "font",
          "attributes": {
            "subtype": "letter-spacing",
            "description": "Controls the horizontal spacing between individual characters in popover headers. This can help make the header text more readable and properly spaced.<br>CSS variable: --wm-popover-header-letter-spacing"
          }
        }
      },
      "body": {
        "padding": {
          "value": "{space.4.value}",
          "type": "space",
          "attributes": {
            "subtype": "space",
            "description": "Controls the internal spacing inside popover body content (the main content area of popover windows). This creates breathing room around the popover content.<br>CSS variable: --wm-popover-body-padding"
          }
        },
        "font-family": {
          "value": "{body.medium.font-family.value}",
          "type": "font",
          "attributes": {
            "subtype": "font-family",
            "description": "Sets the typeface (font style) for popover body content (the main content area of popover windows). This determines whether the body text appears in Arial, Times New Roman, or other font styles.<br>CSS variable: --wm-popover-body-font-family"
          }
        },
        "font-size": {
          "value": "{body.medium.font-size.value}",
          "type": "font",
          "attributes": {
            "subtype": "font-size",
            "description": "Controls how large the popover body content appears (the main content area of popover windows). This affects the size of the body text that users see in the popover.<br>CSS variable: --wm-popover-body-font-size"
          }
        },
        "font-weight": {
          "value": "{body.medium.font-weight.value}",
          "type": "font",
          "attributes": {
            "subtype": "font-weight",
            "description": "Controls how thick or bold the popover body content appears (the main content area of popover windows). 'normal' makes it regular weight, 'bold' makes it thicker, and numbers (100-900) provide fine control over thickness.<br>CSS variable: --wm-popover-body-font-weight"
          }
        },
        "line-height": {
          "value": "{body.medium.line-height.value}",
          "type": "font",
          "attributes": {
            "subtype": "line-height",
            "description": "Controls the vertical spacing between lines when popover body content wraps to multiple lines. This ensures proper spacing for the body text displayed in the popover.<br>CSS variable: --wm-popover-body-line-height"
          }
        },
        "letter-spacing": {
          "value": "{body.medium.letter-spacing.value}",
          "type": "font",
          "attributes": {
            "subtype": "letter-spacing",
            "description": "Controls the horizontal spacing between individual characters in popover body content. This can help make the body text more readable and properly spaced.<br>CSS variable: --wm-popover-body-letter-spacing"
          }
        }
      },
      "arrow": {
        "background": {
          "value": "{color.surface.container.@.value}",
          "type": "color",
          "attributes": {
            "subtype": "color",
            "description": "Sets the background color of popover arrows (the small triangular indicators that point from the popover to its trigger element). This creates the visual connection between the popover and the element that triggered it.<br>CSS variable: --wm-popover-arrow-background"
          }
        },
        "size": {
          "value": "{space.3.value}",
          "type": "space",
          "attributes": {
            "subtype": "space",
            "description": "Controls how large popover arrows appear (the small triangular indicators that point from the popover to its trigger element). This affects the size of the arrow that connects the popover to the triggering element.<br>CSS variable: --wm-popover-arrow-size"
          }
        }
      }
    }
  }
}